DuyTrandeLion/ble-terrarium/Project-nRF52840/Core/Middleware/Services/ble_ess.h
#ifndef BLE_ESS_H__
#define BLE_ESS_H__

#include <stdint.h>
#include <stdbool.h>
#include "ble.h"
#include "ble_srv_common.h"
#include "nrf_sdh_ble.h"

#ifdef __cplusplus
extern "C" {
#endif

#define BLE_UUID_ENVIRONMENTAL_SENSING_SERVICE      0x181A
#define BLE_UUID_ELEVATION                          0x2A6C
#define BLE_UUID_PRESSURE                           0x2A6D
#define BLE_UUID_TEMPERATURE                        0x2A6E
#define BLE_UUID_HUMIDITY                           0x2A6F
#define BLE_UUID_TRUE_WIND_SPEED                    0x2A70
#define BLE_UUID_TRUE_WIND_DIRECTION                0x2A71
#define BLE_UUID_APPARENT_WIND_SPEED                0x2A72
#define BLE_UUID_APPARENT_WIND_DIRECTION            0x2A73
#define BLE_UUID_GUST_FACTOR                        0x2A74
#define BLE_UUID_POLLEN_CONCENTRATION               0x2A75
#define BLE_UUID_UV_INDEX                           0x2A76
#define BLE_UUID_IRRADIANCE                         0x2A77
#define BLE_UUID_RAINFALL                           0x2A78
#define BLE_UUID_WIND_CHILL                         0x2A79
#define BLE_UUID_HEAT_INDEX                         0x2A7A
#define BLE_UUID_DEW_POINT                          0x2A7B
#define BLE_UUID_MAGNETIC_DECLINATION               0x2A7C
#define BLE_UUID_DESCRIPTOR_VALUE_CHANGED           0x2A7D
#define BLE_UUID_MAGNETIC_FLUX_DENSITY_2D           0x2AA0
#define BLE_UUID_MAGNETIC_FLUX_DENSITY_3D           0x2AA1
#define BLE_UUID_BAROMETRIC_PRESSURE_TREND          0x2AA3


#define BLE_ESS_BLE_OBSERVER_PRIO                   2

/**@brief Macro for defining a ble_env instance.
 *
 * @param   _name  Name of the instance.
 * @hideinitializer
 */
#define BLE_ESS_DEF(_name)                          \
    static ble_ess_t _name;                         \
    NRF_SDH_BLE_OBSERVER(_name ## _obs,             \
                         BLE_ESS_BLE_OBSERVER_PRIO, \
                         ble_ess_on_ble_evt,        \
                         &_name)

/**@brief Environmental Sensing Service event type. */
typedef enum
{
    BLE_ESS_EVT_NOTIFICATION_ENABLED, /**< Battery value notification enabled event. */
    BLE_ESS_EVT_NOTIFICATION_DISABLED /**< Battery value notification disabled event. */
} ble_ess_evt_type_t;

/**@brief Environmental Sensing Service event. */
typedef struct
{
    ble_ess_evt_type_t evt_type;    /**< Type of event. */
} ble_ess_evt_t;

typedef struct
{
    int16_t magnetic_flux_density_x;
    int16_t magnetic_flux_density_y;
} magnetic_flux_density_2d_t;

typedef struct
{
    int16_t magnetic_flux_density_x;
    int16_t magnetic_flux_density_y;
    int16_t magnetic_flux_density_z;
} magnetic_flux_density_3d_t;

// Forward declaration of the ble_ess_t type.
typedef struct ble_ess_s ble_ess_t;

/**@brief Environmental Sensing Service event handler type. */
typedef void (*ble_ess_evt_handler_t) (ble_ess_t * p_ess, ble_ess_evt_t * p_evt);

/**@brief Environmental Sensing Service init structure. This contains all options and data needed for
 *        initialization of the service.*/
typedef struct
{
    ble_ess_evt_handler_t   evt_handler;                    /**< Event handler to be called for handling events in the Battery Service.       */
    bool                    support_dc_notification;        /**< TRUE if notification of Descriptor Value Changed is supported.               */
    bool                    support_dc_writable_aux;        /**< TRUE if writable auxiliaries of Descriptor Value Changed is supported.       */
    bool                    support_awd_notification;       /**< TRUE if notification of Apparent Wind Direction is supported.                */
    bool                    support_awd_writable_aux;       /**< TRUE if writable auxiliaries of Apparent Wind Direction is supported.        */
    bool                    support_aws_notification;       /**< TRUE if notification of Apparent Wind Speed is supported.                    */
    bool                    support_aws_writable_aux;       /**< TRUE if writable auxiliaries of Apparent Wind Speed is supported.            */
    bool                    support_dp_notification;        /**< TRUE if notification of Dew Point is supported.                              */
    bool                    support_dp_writable_aux;        /**< TRUE if writable auxiliaries of Dew Point is supported.                      */
    bool                    support_el_notification;        /**< TRUE if notification of Elevation is supported.                              */
    bool                    support_el_writable_aux;        /**< TRUE if writable auxiliaries of Elevation is supported.                      */
    bool                    support_gf_notification;        /**< TRUE if notification of Gust Factor is supported.                            */
    bool                    support_gf_writable_aux;        /**< TRUE if writable auxiliaries of Gust Factor is supported.                    */
    bool                    support_hi_notification;        /**< TRUE if notification of Heat Index is supported.                             */
    bool                    support_hi_writable_aux;        /**< TRUE if writable auxiliaries of Heat Index is supported.                     */
    bool                    support_hum_notification;       /**< TRUE if notification of Humidity is supported.                               */
    bool                    support_hum_writable_aux;       /**< TRUE if writable auxiliaries of Humidity is supported.                       */
    bool                    support_ird_notification;       /**< TRUE if notification of Irradiance is supported.                             */
    bool                    support_ird_writable_aux;       /**< TRUE if writable auxiliaries of Irradiance is supported.                     */
    bool                    support_pc_notification;        /**< TRUE if notification of Pollen Concentration is supported.                   */
    bool                    support_pc_writable_aux;        /**< TRUE if writable auxiliaries of Pollen Concentration is supported.           */
    bool                    support_rf_notification;        /**< TRUE if notification of Rainfall is supported.                               */
    bool                    support_rf_writable_aux;        /**< TRUE if writable auxiliaries of Rainfall is supported.                       */
    bool                    support_ps_notification;        /**< TRUE if notification of Pressure is supported.                               */
    bool                    support_ps_writable_aux;        /**< TRUE if writable auxiliaries of Pressure is supported.                       */
    bool                    support_tem_notification;       /**< TRUE if notification of Temperature is supported.                            */
    bool                    support_tem_writable_aux;       /**< TRUE if writable auxiliaries of Temperature is supported.                    */
    bool                    support_twd_notification;       /**< TRUE if notification of True Wind Direction is supported.                    */
    bool                    support_twd_writable_aux;       /**< TRUE if writable auxiliaries of True Wind Direction is supported.            */
    bool                    support_tws_notification;       /**< TRUE if notification of True Wind Speed is supported.                        */
    bool                    support_tws_writable_aux;       /**< TRUE if writable auxiliaries of True Wind Speed is supported.                */
    bool                    support_uvi_notification;       /**< TRUE if notification of UV Index is supported.                               */
    bool                    support_uvi_writable_aux;       /**< TRUE if writable auxiliaries of UV Index is supported.                       */
    bool                    support_wc_notification;        /**< TRUE if notification of Wind Chill is supported.                             */
    bool                    support_wc_writable_aux;        /**< TRUE if writable auxiliaries of Wind Chill is supported.                     */
    bool                    support_bpt_notification;       /**< TRUE if notification of Barometric Pressure Trend is supported.              */
    bool                    support_bpt_writable_aux;       /**< TRUE if writable auxiliaries of Barometric Pressure Trend is supported.      */
    bool                    support_md_notification;        /**< TRUE if notification of Magnetic Declination is supported.                   */
    bool                    support_md_writable_aux;        /**< TRUE if writable auxiliaries of Magnetic Declination is supported.           */
    bool                    support_mfd2d_notification;     /**< TRUE if notification of Magnetic Flux Density - 2D is supported.             */
    bool                    support_mfd2d_writable_aux;     /**< TRUE if writable auxiliaries of Magnetic Flux Density - 2D is supported.     */
    bool                    support_mfd3d_notification;     /**< TRUE if notification of Magnetic Flux Density - 3D is supported.             */
    bool                    support_mfd3d_writable_aux;     /**< TRUE if writable auxiliaries of Magnetic Flux Density - 3D is supported.     */

