DuyTrandeLion/ble-terrarium/Project-nRF52840/Core/Middleware/Services/ble_ess.h
    int8_t                      initial_dew_point;
    int8_t                      initial_heat_index;
    int8_t                      initial_wind_chill;
    uint8_t                     initial_gust_factor;
    uint8_t                     initial_uv_index;
    uint8_t                     initial_barometric_pressure_trend;
    int16_t                     initial_temperature;
    magnetic_flux_density_2d_t  initial_magnetic_flux_density_2d;
    magnetic_flux_density_3d_t  initial_magnetic_flux_density_3d;
    uint16_t                    initial_apparent_wind_direction;
    uint16_t                    initial_apparent_wind_speed;
    uint16_t                    initial_humidity;
    uint16_t                    initial_irradiance;
    uint16_t                    initial_true_wind_direction;
    uint16_t                    initial_true_wind_speed;
    uint16_t                    initial_rainfall;
    uint16_t                    initial_magnetic_declination;
    int32_t                     initial_elevation;
    uint32_t                    initial_pollen_concentration;
    uint32_t                    initial_pressure; 

    security_req_t          awd_rd_sec;                 /**< Security requirement for reading the AWD characteristic value.   */
    security_req_t          awd_cccd_wr_sec;            /**< Security requirement for writing the AWD characteristic CCCD.    */
    security_req_t          aws_rd_sec;                 /**< Security requirement for reading the AWS characteristic value.   */
    security_req_t          aws_cccd_wr_sec;            /**< Security requirement for writing the AWS characteristic CCCD.    */
    security_req_t          dp_rd_sec;                  /**< Security requirement for reading the DP characteristic value.    */
    security_req_t          dp_cccd_wr_sec;             /**< Security requirement for writing the DP characteristic CCCD.     */
    security_req_t          el_rd_sec;                  /**< Security requirement for reading the EL characteristic value.    */
    security_req_t          el_cccd_wr_sec;             /**< Security requirement for writing the EL characteristic CCCD.     */
    security_req_t          gf_rd_sec;                  /**< Security requirement for reading the GF characteristic value.    */
    security_req_t          gf_cccd_wr_sec;             /**< Security requirement for writing the GF characteristic CCCD.     */
    security_req_t          hi_rd_sec;                  /**< Security requirement for reading the HI characteristic value.    */
    security_req_t          hi_cccd_wr_sec;             /**< Security requirement for writing the HI characteristic CCCD.     */
    security_req_t          hum_rd_sec;                 /**< Security requirement for reading the HUM characteristic value.   */
    security_req_t          hum_cccd_wr_sec;            /**< Security requirement for writing the HUM characteristic CCCD.    */
    security_req_t          ird_rd_sec;                 /**< Security requirement for reading the IRD characteristic value.   */
    security_req_t          ird_cccd_wr_sec;            /**< Security requirement for writing the IRD characteristic CCCD.    */
    security_req_t          pc_rd_sec;                  /**< Security requirement for reading the PC characteristic value.    */
    security_req_t          pc_cccd_wr_sec;             /**< Security requirement for writing the PC characteristic CCCD.     */
    security_req_t          rf_rd_sec;                  /**< Security requirement for reading the RF characteristic value.    */
    security_req_t          rf_cccd_wr_sec;             /**< Security requirement for writing the RF characteristic CCCD.     */
    security_req_t          ps_rd_sec;                  /**< Security requirement for reading the PS characteristic value.    */
    security_req_t          ps_cccd_wr_sec;             /**< Security requirement for writing the PS characteristic CCCD.     */
    security_req_t          tem_rd_sec;                 /**< Security requirement for reading the TEM characteristic value.   */
    security_req_t          tem_cccd_wr_sec;            /**< Security requirement for writing the TEM characteristic CCCD.    */
    security_req_t          twd_rd_sec;                 /**< Security requirement for reading the TWD characteristic value.   */
    security_req_t          twd_cccd_wr_sec;            /**< Security requirement for writing the TWD characteristic CCCD.    */
    security_req_t          tws_rd_sec;                 /**< Security requirement for reading the TWS characteristic value.   */
    security_req_t          tws_cccd_wr_sec;            /**< Security requirement for writing the TWS characteristic CCCD.    */
    security_req_t          uvi_rd_sec;                 /**< Security requirement for reading the UVI characteristic value.   */
    security_req_t          uvi_cccd_wr_sec;            /**< Security requirement for writing the UVI characteristic CCCD.    */
    security_req_t          wc_rd_sec;                  /**< Security requirement for reading the WC characteristic value.    */
    security_req_t          wc_cccd_wr_sec;             /**< Security requirement for writing the WC characteristic CCCD.     */
    security_req_t          bpt_rd_sec;                 /**< Security requirement for reading the BPT characteristic value.   */
    security_req_t          bpt_cccd_wr_sec;            /**< Security requirement for writing the BPT characteristic CCCD.    */
    security_req_t          md_rd_sec;                  /**< Security requirement for reading the MD characteristic value.    */
    security_req_t          md_cccd_wr_sec;             /**< Security requirement for writing the MD characteristic CCCD.     */
    security_req_t          mfd2d_rd_sec;               /**< Security requirement for reading the MFD2D characteristic value. */
    security_req_t          mfd2d_cccd_wr_sec;          /**< Security requirement for writing the MFD2D characteristic CCCD.  */
    security_req_t          mfd3d_rd_sec;               /**< Security requirement for reading the MFD3D characteristic value. */
    security_req_t          mfd3d_cccd_wr_sec;          /**< Security requirement for writing the MFD3D characteristic CCCD.  */
} ble_ess_init_t;


/**@brief Environmental Sensing Service structure. This contains various status information for the service. */
struct ble_ess_s
{
    ble_ess_evt_handler_t     evt_handler;                      /**< Event handler to be called for handling events in the Battery Service.       */
    bool                      is_dc_notification_supported;     /**< TRUE if notification of Descriptor Value Changed is supported.               */
    bool                      is_dc_writable_aux_supported;     /**< TRUE if writable auxiliaries of Descriptor Value Changed is supported.       */
    bool                      is_awd_notification_supported;    /**< TRUE if notification of Apparent Wind Direction is supported.                */
    bool                      is_awd_writable_aux_supported;    /**< TRUE if writable auxiliaries of Apparent Wind Direction is supported.        */
    bool                      is_aws_notification_supported;    /**< TRUE if notification of Apparent Wind Speed is supported.                    */
    bool                      is_aws_writable_aux_supported;    /**< TRUE if writable auxiliaries of Apparent Wind Speed is supported.            */
    bool                      is_dp_notification_supported;     /**< TRUE if notification of Dew Point is supported.                              */
    bool                      is_dp_writable_aux_supported;     /**< TRUE if writable auxiliaries of Dew Point is supported.                      */
    bool                      is_el_notification_supported;     /**< TRUE if notification of Elevation is supported.                              */
    bool                      is_el_writable_aux_supported;     /**< TRUE if writable auxiliaries of Elevation is supported.                      */
    bool                      is_gf_notification_supported;     /**< TRUE if notification of Gust Factor is supported.                            */
    bool                      is_gf_writable_aux_supported;     /**< TRUE if writable auxiliaries of Gust Factor is supported.                    */
    bool                      is_hi_notification_supported;     /**< TRUE if notification of Heat Index is supported.                             */
    bool                      is_hi_writable_aux_supported;     /**< TRUE if writable auxiliaries of Heat Index is supported.                     */
    bool                      is_hum_notification_supported;    /**< TRUE if notification of Humidity is supported.                               */
    bool                      is_hum_writable_aux_supported;    /**< TRUE if writable auxiliaries of Humidity is supported.                       */
    bool                      is_ird_notification_supported;    /**< TRUE if notification of Irradiance is supported.                             */
    bool                      is_ird_writable_aux_supported;    /**< TRUE if writable auxiliaries of Irradiance is supported.                     */
    bool                      is_pc_notification_supported;     /**< TRUE if notification of Pollen Concentration is supported.                   */
    bool                      is_pc_writable_aux_supported;     /**< TRUE if writable auxiliaries of Pollen Concentration is supported.           */
    bool                      is_rf_notification_supported;     /**< TRUE if notification of Rainfall is supported.                               */
    bool                      is_rf_writable_aux_supported;     /**< TRUE if writable auxiliaries of Rainfall is supported.                       */
    bool                      is_ps_notification_supported;     /**< TRUE if notification of Pressure is supported.                               */
    bool                      is_ps_writable_aux_supported;     /**< TRUE if writable auxiliaries of Pressure is supported.                       */
    bool                      is_tem_notification_supported;    /**< TRUE if notification of Temperature is supported.                            */
    bool                      is_tem_writable_aux_supported;    /**< TRUE if writable auxiliaries of Temperature is supported.                    */
    bool                      is_twd_notification_supported;    /**< TRUE if notification of True Wind Direction is supported.                    */
    bool                      is_twd_writable_aux_supported;    /**< TRUE if writable auxiliaries of True Wind Direction is supported.            */
    bool                      is_tws_notification_supported;    /**< TRUE if notification of True Wind Speed is supported.                        */
    bool                      is_tws_writable_aux_supported;    /**< TRUE if writable auxiliaries of True Wind Speed is supported.                */
    bool                      is_uvi_notification_supported;    /**< TRUE if notification of UV Index is supported.                               */
    bool                      is_uvi_writable_aux_supported;    /**< TRUE if writable auxiliaries of UV Index is supported.                       */
    bool                      is_wc_notification_supported;     /**< TRUE if notification of Wind Chill is supported.                             */
    bool                      is_wc_writable_aux_supported;     /**< TRUE if writable auxiliaries of Wind Chill is supported.                     */
    bool                      is_bpt_notification_supported;    /**< TRUE if notification of Barometric Pressure Trend is supported.              */
    bool                      is_bpt_writable_aux_supported;    /**< TRUE if writable auxiliaries of Barometric Pressure Trend is supported.      */
    bool                      is_md_notification_supported;     /**< TRUE if notification of Magnetic Declination is supported.                   */
    bool                      is_md_writable_aux_supported;     /**< TRUE if writable auxiliaries of Magnetic Declination is supported.           */
    bool                      is_mfd2d_notification_supported;  /**< TRUE if notification of Magnetic Flux Density - 2D is supported.             */
    bool                      is_mfd2d_writable_aux_supported;  /**< TRUE if writable auxiliaries of Magnetic Flux Density - 2D is supported.     */
    bool                      is_mfd3d_notification_supported;  /**< TRUE if notification of Magnetic Flux Density - 3D is supported.             */
    bool                      is_mfd3d_writable_aux_supported;  /**< TRUE if writable auxiliaries of Magnetic Flux Density - 3D is supported.     */
    uint16_t                  service_handle;                   /**< Handle of Battery Service (as provided by the BLE stack). */
    uint16_t                  conn_handle;                      /**< Handle of the current connection (as provided by the BLE stack, is BLE_CONN_HANDLE_INVALID if not in a connection). */
    ble_gatts_char_handles_t  dc_handles;
    ble_gatts_char_handles_t  awd_handles;
    ble_gatts_char_handles_t  aws_handles;
    ble_gatts_char_handles_t  dp_handles;
    ble_gatts_char_handles_t  el_handles;
    ble_gatts_char_handles_t  gf_handles;
    ble_gatts_char_handles_t  hi_handles;
    ble_gatts_char_handles_t  hum_handles;
    ble_gatts_char_handles_t  ird_handles;
    ble_gatts_char_handles_t  pc_handles;
    ble_gatts_char_handles_t  rf_handles;
    ble_gatts_char_handles_t  ps_handles;
    ble_gatts_char_handles_t  tem_handles;
    ble_gatts_char_handles_t  twd_handles;
    ble_gatts_char_handles_t  tws_handles;
    ble_gatts_char_handles_t  uvi_handles;
    ble_gatts_char_handles_t  wc_handles;
    ble_gatts_char_handles_t  bpt_handles;
    ble_gatts_char_handles_t  md_handles;
    ble_gatts_char_handles_t  mfd2d_handles;
    ble_gatts_char_handles_t  mfd3d_handles;
};


/**@brief Function for initializing the Environmental Sensing Service.
 *
 * @param[out]  p_ess       Environmental Sensing Service structure. This structure will have to be supplied by
 *                          the application. It will be initialized by this function, and will later
 *                          be used to identify this particular service instance.
 * @param[in]   p_ess_init  Information needed to initialize the service.
 *
 * @return      NRF_SUCCESS on successful initialization of service, otherwise an error code.
 */
ret_code_t ble_ess_init(ble_ess_t * p_ess, const ble_ess_init_t * p_ess_init);


